backend/app/controllers/api/v1/registrations_controller.rb

    def create
      @user = User.new(user_params)

      if @user.save
---
INSERT INTO "users" ("email", "password_digest", "verified", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["email", "[FILTERED]"], ["password_digest", "[FILTERED]"], ["verified", 0], ["created_at", "2024-11-05 01:50:28.284137"], ["updated_at", "2024-11-05 01:50:28.284137"]]