backend/app/controllers/api/v1/todos_controller.rb

INSERT INTO "todos" ("title", "description", "label", "priority", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
    def create
      @todo = Todo.new(todo_params)
      @todo.save!

UPDATE "todos" SET "title" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "My new Title"], ["updated_at", "2024-11-01 23:15:54.394593"], ["id", 2]]
---
    def update
      @todo.update!(todo_params)

DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 1]]
---
    def destroy
      @todo.destroy!

DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 1]]
---
    def destroy_many
      Todo.where(id: params[:ids]).destroy_all